### **Pyspark Intial setup**

In [1]:
!pip install pyspark py4j

Collecting pyspark
  Downloading pyspark-3.2.1.tar.gz (281.4 MB)
     |████████████████████████████████| 281.4 MB 29 kB/s
Collecting py4j
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     |████████████████████████████████| 199 kB 50.1 MB/s
  Downloading py4j-0.10.9.3-py2.py3-none-any.whl (198 kB)
     |████████████████████████████████| 198 kB 36.9 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.2.1-py2.py3-none-any.whl size=281853642 sha256=f2dae49646708f0ff7d7093848037e7d36e21ec74366a2842d080ccc9b8f6b14
  Stored in directory: /root/.cache/pip/wheels/9f/f5/07/7cd8017084dce4e93e84e92efd1e1d5334db05f2e83bcef74f
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.3 pyspark-3.2.1

In [2]:
!pip install findspark

Collecting findspark
  Downloading findspark-2.0.1-py2.py3-none-any.whl (4.4 kB)
Installing collected packages: findspark
Successfully installed findspark-2.0.1

In [3]:
from pyspark.sql import SparkSession
import findspark
from pyspark import SparkContext

In [4]:
findspark.init()
#create SparkContext
sc = SparkContext.getOrCreate()
print("SparkCOntext: ",sc)

SparkCOntext:  <SparkContext master=local[*] appName=pyspark-shell>

In [5]:
spark = SparkSession.builder\
        .master("Local1")\
        .appName("MyApplication1")\
        .getOrCreate()

### **PySpark Practice Session#1**

### **Creating PySpark DataFrame Using CSV**

### **Reading the DataFrame**
### **Checking Data Types or Meta Data**
### **Selecting Particualr Columns**
### **Describe or Summary Information of DataFrame**
### **Adding New Columns**
### **Dropping the Columns**
### **Renaming the Columns**

## **Reading the Data and Creating DataFrame**

In [6]:
#Reading The Data Frames
df_emp = spark.read.option("InferSchema","true").option("delimiter",",").option("header","true").csv('sample_data/Emp_Table_Extract.csv')

### **Checking the Meta Data Information**

In [7]:
#Checking the Meta Data Information
#To Print Schema Details
df_emp.printSchema()

root
 |-- EMPNO: integer (nullable = true)
 |-- ENAME: string (nullable = true)
 |-- JOB: string (nullable = true)
 |-- MGR: integer (nullable = true)
 |-- HIREDATE: string (nullable = true)
 |-- SAL: integer (nullable = true)
 |-- COMM: integer (nullable = true)
 |-- DEPTNO: integer (nullable = true)

In [8]:
#To Print Column Details
df_emp.columns

['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [9]:
#To Print Column Details
df_emp.columns

['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [ ]:
#To Print Column data type
df_emp.dtypes

[('EMPNO', 'int'),
 ('ENAME', 'string'),
 ('JOB', 'string'),
 ('MGR', 'int'),
 ('HIREDATE', 'string'),
 ('SAL', 'int'),
 ('COMM', 'int'),
 ('DEPTNO', 'int')]

### **Selecting Particular Columns**

In [ ]:
df_emp.select('ENAME','EMPNO').show()

+------+-----+
| ENAME|EMPNO|
+------+-----+
|  KING| 7839|
| BLAKE| 7698|
| CLARK| 7782|
| JONES| 7566|
| SCOTT| 7788|
|  FORD| 7902|
| SMITH| 7369|
| ALLEN| 7499|
|  WARD| 7521|
|MARTIN| 7654|
|TURNER| 7844|
| ADAMS| 7876|
| JAMES| 7900|
|MILLER| 7934|
+------+-----+

### **Describe or Summary Information of DataFrame**

In [ ]:
df_emp.describe().show()

+-------+------------------+-----+--------+------------------+---------+------------------+-----------------+------------------+
|summary|             EMPNO|ENAME|     JOB|               MGR| HIREDATE|               SAL|             COMM|            DEPTNO|
+-------+------------------+-----+--------+------------------+---------+------------------+-----------------+------------------+
|  count|                14|   14|      14|                13|       14|                14|                4|                14|
|   mean| 7726.571428571428| null|    null| 7739.307692307692|     null| 2073.214285714286|            550.0|22.142857142857142|
| stddev|178.29436087795676| null|    null|103.71466033898376|     null|1182.5032235162716|602.7713773341708| 8.017837257372731|
|    min|              7369|ADAMS| ANALYST|              7566|01-MAY-81|               800|                0|                10|
|    max|              7934| WARD|SALESMAN|              7902|28-SEP-81|              5000|             1400|                30|
+-------+------------------+-----+--------+------------------+---------+------------------+-----------------+------------------+

### **Adding New Columns**

In [ ]:
df_emp.withColumn('TotSal',df_emp['SAL']+df_emp['COMM']).show()

+-----+------+---------+----+---------+----+----+------+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|TotSal|
+-----+------+---------+----+---------+----+----+------+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|  null|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|  null|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|  null|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|  null|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|  null|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|  null|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|  null|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|  1900|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|  1750|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|  2650|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|  1500|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|  null|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|  null|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|  null|
+-----+------+---------+----+---------+----+----+------+------+

### **Dropping the Columns**

In [ ]:
df_emp.drop('TotSal').show()

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

### **Renaming The column**

In [ ]:
df_emp.withColumnRenamed('ENAME','RENAME').collect()

[Row(EMPNO=7839, RENAME='KING', JOB='PRESIDENT', MGR=None, HIREDATE='17-NOV-81', SAL=5000, COMM=None, DEPTNO=10),
 Row(EMPNO=7698, RENAME='BLAKE', JOB='MANAGER', MGR=7839, HIREDATE='01-MAY-81', SAL=2850, COMM=None, DEPTNO=30),
 Row(EMPNO=7782, RENAME='CLARK', JOB='MANAGER', MGR=7839, HIREDATE='09-JUN-81', SAL=2450, COMM=None, DEPTNO=10),
 Row(EMPNO=7566, RENAME='JONES', JOB='MANAGER', MGR=7839, HIREDATE='02-APR-81', SAL=2975, COMM=None, DEPTNO=20),
 Row(EMPNO=7788, RENAME='SCOTT', JOB='ANALYST', MGR=7566, HIREDATE='19-APR-87', SAL=3000, COMM=None, DEPTNO=20),
 Row(EMPNO=7902, RENAME='FORD', JOB='ANALYST', MGR=7566, HIREDATE='03-DEC-81', SAL=3000, COMM=None, DEPTNO=20),
 Row(EMPNO=7369, RENAME='SMITH', JOB='CLERK', MGR=7902, HIREDATE='17-DEC-80', SAL=800, COMM=None, DEPTNO=20),
 Row(EMPNO=7499, RENAME='ALLEN', JOB='SALESMAN', MGR=7698, HIREDATE='20-FEB-81', SAL=1600, COMM=300, DEPTNO=30),
 Row(EMPNO=7521, RENAME='WARD', JOB='SALESMAN', MGR=7698, HIREDATE='22-FEB-81', SAL=1250, COMM=500, DEPTNO=30),
 Row(EMPNO=7654, RENAME='MARTIN', JOB='SALESMAN', MGR=7698, HIREDATE='28-SEP-81', SAL=1250, COMM=1400, DEPTNO=30),
 Row(EMPNO=7844, RENAME='TURNER', JOB='SALESMAN', MGR=7698, HIREDATE='08-SEP-81', SAL=1500, COMM=0, DEPTNO=30),
 Row(EMPNO=7876, RENAME='ADAMS', JOB='CLERK', MGR=7788, HIREDATE='23-MAY-87', SAL=1100, COMM=None, DEPTNO=20),
 Row(EMPNO=7900, RENAME='JAMES', JOB='CLERK', MGR=7698, HIREDATE='03-DEC-81', SAL=950, COMM=None, DEPTNO=30),
 Row(EMPNO=7934, RENAME='MILLER', JOB='CLERK', MGR=7782, HIREDATE='23-JAN-82', SAL=1300, COMM=None, DEPTNO=10)]

In [ ]:
df_emp.withColumnRenamed('ENAME','RENAME').show()

+-----+------+---------+----+---------+----+----+------+
|EMPNO|RENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

# **PySpark Handing Missing Values**
### **Dropping Columns**
### **Dropping Rows**
### **Various Parameters In Dropping Functionality**
### **Handling Missing Vlaues by Mean**

In [ ]:
df_emp1 = df_emp

In [ ]:
df_emp1.show()

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

In [ ]:
df_emp1.drop('HIREDATE').show()

+-----+------+---------+----+----+----+------+
|EMPNO| ENAME|      JOB| MGR| SAL|COMM|DEPTNO|
+-----+------+---------+----+----+----+------+
| 7839|  KING|PRESIDENT|null|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|2450|null|    10|
| 7566| JONES|  MANAGER|7839|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|3000|null|    20|
| 7369| SMITH|    CLERK|7902| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|1250|1400|    30|
| 7844|TURNER| SALESMAN|7698|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|1100|null|    20|
| 7900| JAMES|    CLERK|7698| 950|null|    30|
| 7934|MILLER|    CLERK|7782|1300|null|    10|
+-----+------+---------+----+----+----+------+

In [ ]:
#Dropping the Null value data
df_emp1.na.drop().show()
#The function will delete all the NULL values realted rows.

+-----+------+--------+----+---------+----+----+------+
|EMPNO| ENAME|     JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+--------+----+---------+----+----+------+
| 7499| ALLEN|SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD|SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN|SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER|SALESMAN|7698|08-SEP-81|1500|   0|    30|
+-----+------+--------+----+---------+----+----+------+

In [ ]:
#If we want to delete row based on the particular condition, we have give
df_emp1.na.drop(how="any",thresh=2).show()
#Note: Based on the above condition If any row having 2 null vlaues we can drop that particular rows.
#Inside the drop() we have options are available like how,thresh and subset.
#If how = all means, if all the values are null then it will delete the row. By default it will "any",

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

In [ ]:
df_emp1.na.drop(how="any",subset='COMM').show()
#Note: In the above condition, Any null values in the COMM column corresponding rows will get delete.

+-----+------+--------+----+---------+----+----+------+
|EMPNO| ENAME|     JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+--------+----+---------+----+----+------+
| 7499| ALLEN|SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD|SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN|SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER|SALESMAN|7698|08-SEP-81|1500|   0|    30|
+-----+------+--------+----+---------+----+----+------+

### **Filling Missing or NULL values**

In [ ]:
df_emp.na.fill('HHH').show()
#Note: This is not working here. But we have multiple option based on the particular values we can apply.

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

# **PySpark DataFrames**
### **Filter Operations**
### **&,| and ==**
### **~**

In [ ]:
df_emp.filter("deptno == 10").show()

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

In [ ]:
#Alternative way
df_emp.filter(df_emp['DEPTNO']==10).show()

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

In [ ]:
#After applying the filters, If you want to display particular columns
df_emp.filter(df_emp['DEPTNO']==10).select(['ENAME','DEPTNO','SAL']).show()

+------+------+----+
| ENAME|DEPTNO| SAL|
+------+------+----+
|  KING|    10|5000|
| CLARK|    10|2450|
|MILLER|    10|1300|
+------+------+----+

In [ ]:
df_emp.filter((df_emp['DEPTNO']==10) & (df_emp['SAL']>2000)).show()

+-----+-----+---------+----+---------+----+----+------+
|EMPNO|ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+-----+---------+----+---------+----+----+------+
| 7839| KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7782|CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
+-----+-----+---------+----+---------+----+----+------+

In [ ]:
df_emp.filter((df_emp['DEPTNO']==10) | (df_emp['SAL']>2000)).show()

+-----+------+---------+----+---------+----+----+------+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+---------+----+----+------+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|
+-----+------+---------+----+---------+----+----+------+

# **PySpark GroupBy and Aggregate Functions**

In [ ]:
#from pyspark.sql.functions import sum

In [ ]:
df_emp.groupBy("deptno").agg(sum("sal")).alias("Test").show()

+------+--------+
|deptno|sum(sal)|
+------+--------+
|    20|   10875|
|    10|    8750|
|    30|    9400|
+------+--------+

# **Window Related Functions OR Oracle Analytical Functions**

In [ ]:
from pyspark.sql.functions import *
from pyspark.sql.window import *

In [ ]:
ranks = Window.orderBy(df_emp['sal'].desc())

In [ ]:
df_emp.withColumn("Ranks",row_number().over(ranks)).show()

+-----+------+---------+----+---------+----+----+------+-----+
|EMPNO| ENAME|      JOB| MGR| HIREDATE| SAL|COMM|DEPTNO|Ranks|
+-----+------+---------+----+---------+----+----+------+-----+
| 7839|  KING|PRESIDENT|null|17-NOV-81|5000|null|    10|    1|
| 7788| SCOTT|  ANALYST|7566|19-APR-87|3000|null|    20|    2|
| 7902|  FORD|  ANALYST|7566|03-DEC-81|3000|null|    20|    3|
| 7566| JONES|  MANAGER|7839|02-APR-81|2975|null|    20|    4|
| 7698| BLAKE|  MANAGER|7839|01-MAY-81|2850|null|    30|    5|
| 7782| CLARK|  MANAGER|7839|09-JUN-81|2450|null|    10|    6|
| 7499| ALLEN| SALESMAN|7698|20-FEB-81|1600| 300|    30|    7|
| 7844|TURNER| SALESMAN|7698|08-SEP-81|1500|   0|    30|    8|
| 7934|MILLER|    CLERK|7782|23-JAN-82|1300|null|    10|    9|
| 7521|  WARD| SALESMAN|7698|22-FEB-81|1250| 500|    30|   10|
| 7654|MARTIN| SALESMAN|7698|28-SEP-81|1250|1400|    30|   11|
| 7876| ADAMS|    CLERK|7788|23-MAY-87|1100|null|    20|   12|
| 7900| JAMES|    CLERK|7698|03-DEC-81| 950|null|    30|   13|
| 7369| SMITH|    CLERK|7902|17-DEC-80| 800|null|    20|   14|
+-----+------+---------+----+---------+----+----+------+-----+